/*
复数四则运算
问题描述：设计一个可进行复数运算的演示程序。
基本要求：实现六种基本运算，包括生成复数、复数求和、求差、求积、分离实部和虚部，运算结果以相应形式显示。
测试数据：
（1）0；0；应输出 “0”
（2）3.1，0；4.22，8.9；应输出 “7.32+i8.9”
（3）-1.33，2.34；0.1，-6.5；应输出 “-1.23-i4.16”
（4）0，9.7；-2.1，-9.7；应输出 “-2.1”
（5）7.7，-8；-7.7，0；应输出 “-i8”
实现提示：定义复数为两个有次序关系的实数构成的抽象数据类型，利用实数操作实现复数操作。
选作内容：实现复数的其他运算，如相除、求共轭等。
*/
#include<stdio.h>
#include<string.h>

#define MAXSIZE 100

typedef int elemtype;

typedef struct
{
    elemtype data[MAXSIZE];
    int length;
}Seqlist;

void transtion{
    
}

int main(){
    
    return 0;
}